Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་ཆོས་རྣམས་ལ་ཀུན་རྫོབ་དང་དོན་དམ་པའི་དབང་གིས་ཆོས་སུ་འདུ་ཤེས་པ་ཡང་འཇུག་ཆོས་མ་ཡིན་པར་འདུ་ཤེས་པ་ཡང་འཇུག་སྟེ། དེ་བས་ན་ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱིས་ཡོངས་སུ་སྟོང་ཞེས་བྱ་བ་གསུངས་སོ།
en: There, for dharmas, governed by the conventional and ultimate, it engages with perceiving dharmas as dharmas and also engages with perceiving them as not dharmas as well, so it says “all dharmas are empty of the intrinsic nature of all dharmas.”

source: །མངོན་པར་བྱང་ཆུབ་པ་ཡང་སྟོན་ལ་མངོན་པར་བྱང་ཆུབ་པ་མེད་པར་ཡང་མཐོང་སྟེ། དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཡང་། ཆོས་གང་ཡང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མ་མཆིས་ཞེས་བྱ་བ་གསུངས་སོ།
en: It teaches awakening but also sees the nonexistence of awakening, so it says “but still, bodhisattva great beings abiding in this perfection of wisdom fully awaken to unsurpassed, perfect, complete awakening without fully awakening to any dharma at all.”

source: །ཆོས་ཀྱི་འཁོར་ལོ་ཡང་བསྐོར་ལ་ཆོས་གང་ཡང་བསྐོར་བའམ་མི་བསྐོར་བར་བགྱིད་པ་ཡང་མ་མཆིས་ཏེ་ཞེས་བྱ་བས་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་གསང་བ་བསྟན་ཏོ།
en: Teaching the secret turning of the wheel of Dharma, it says “will turn the wheel of the Dharma but will not turn or not turn any Dharma.”

source: །དེའི་འོག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་རྣམ་པ་བརྒྱད་ཀྱིས་འགྲེལ་ཏེ། ཆོས་མེད་པ་དང་འཁོར་ལོ་མེད་པ་དང་། བསྐོར་བ་མེད་པ་དང་བཤད་པའི་ངོ་བོ་ཉིད་མེད་པ་དང་། འཆད་པ་པོ་མེད་པ་དང་ཉན་པ་པོ་མེད་པ་དང་རྟོག་པ་མེད་པ་དང་། འཕགས་པའི་གང་ཟག་མེད་པའོ།
en: Then there is the section with the eightfold turning of the wheel of Dharma: the nonexistence of the Dharma, the nonexistence of the wheel, the nonexistence of the turning, the nonexistence of the intrinsic nature of an explanation, the nonexistence of one who explains, the nonexistence of one who listens, the nonexistence of realization, and the nonexistence of a noble person.

source: །དེ་ལ་ཆོས་མེད་པ་ནི་ཆོས་གང་ཡང་ཡོངས་སུ་མཐོང་བ་ཡང་མ་མཆིས་ལ་ཆོས་གང་ཡང་ཡོངས་སུ་མ་མཐོང་བ་ཡང་མ་མཆིས་པ་ལགས་སོ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: There, about the nonexistence of the Dharma, it says “will not see any Dharma at all, and will not not see any Dharma at all either.”

source: །འཁོར་ལོ་མེད་པ་ནི་འདི་ལྟར་གང་བསྐོར་བར་བགྱིའམ་མི་བསྐོར་བར་བགྱི་བའི་ཆོས་དེ་ལྟ་བུ་དམིགས་པ་མ་མཆིས་ཏེ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: About the nonexistence of the wheel, it says “because a Dharma that will be turned or will not be turned cannot be apprehended.”

source: །བསྐོར་བ་མེད་པ་ནི་སྟོང་པ་ཉིད་ནི་བསྐོར་བར་བགྱིད་པའམ་མི་བསྐོར་བར་བགྱིད་པ་མ་ལགས་སོ།
en: About the nonexistence of turning, it says “emptiness does not turn it, nor does it not turn it.

source: །མཚན་མ་མ་མཆིས་པ་དང་སྨོན་པ་མ་མཆིས་པ་ནི་བསྐོར་བར་བགྱིད་པ་འམ་མི་བསྐོར་བར་བགྱིད་པ་མ་ལགས་སོ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: The signless and the wishless also do not turn it, nor do they not turn it.”

source: །བཤད་པ་མེད་པ་ནི་དེ་ལྟར་ན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་དང་། རབ་ཏུ་བསྟན་པ་དང་ཞེས་བྱ་བ་ནས་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་ཡོངས་སུ་དག་པའོ་ཞེས་བྱ་བའི་བར་དུ་གསུངས་པའོ།
en: About the nonexistence of an explanation, it says “therefore, this teaching of the perfection of wisdom, this illumination,” up to “is the teaching of the perfection of wisdom that is perfectly pure.”

source: །འཆད་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་དེ་ཡང་སུས་ཀྱང་མ་བསྟན་ཞེས་བྱ་བ་གསུངས་པའོ།
en: About the nonexistence of one who explains, it says “nobody teaches that teaching of the perfection of wisdom.”

source: །ཉན་པ་མེད་པ་ནི་སུས་ཀྱང་མ་བཟུང་ངོ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: About the nonexistence of one who listens, it says “and nobody receives it.”

source: །རྟོགས་པ་མེད་པ་དེ་ནི་སུས་ཀྱང་མངོན་སུམ་དུ་མ་བགྱིས་སོ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: About the nonexistence of realization, it says “nobody has directly realized it.”

source: །འཕགས་པའི་གང་ཟག་མེད་པ་ནི་དེ་ལ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་སུ་ཡང་མ་མཆིས་ཏེ།
en: And about the absence of a noble person, it says “nobody has entered into nirvāṇa either.

source: ཆོས་བསྟན་པ་འདི་ལ་སུ་འང་སྦྱིན་གནས་སུ་འགྱུར་བ་མ་མཆིས་སོ་ཞེས་བྱ་བ་གསུངས་པའོ།
en: And in this Dharma teaching there is also nobody who becomes worthy of offerings.”

source: །རབ་འབྱོར་ནམ་མཁའ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་ལྟར་དམིགས་པའི་བདག་ཉིད་དུ་མེད་པ་ཡིན་གྱི། དམིགས་པ་མེད་པའི་བདག་ཉིད་དུ་མེད་པ་མ་ཡིན་ནོ།
en: Glosses “Because space is a nonexistent thing, Subhūti”— like space, it is not truly real in a form you can apprehend, and not not truly real in a form that cannot be apprehended. “

source: །ཆོས་ཐམས་ཅད་དམིགས་པ་མེད་པར་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ནི་ཀུན་བརྟགས་པ་སྟེ་དམིགས་སུ་མེད་པའི་བདག་ཉིད་དུ་མཉམ་པའོ།
en: Because all dharmas are equally nonapprehendable, Subhūti”— all dharmas are equally imaginary with a nature that cannot be apprehended. “

source: །མིང་མེད་པ་དང་ལུས་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་གཟུགས་མེད་པའི་ཆོས་དང་། གཟུགས་ཀྱི་ཆོས་རྣམས་ཚིག་ཏུ་གྱུར་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because of not having a name and body”— this means formless dharmas and form dharmas are not in the form of names. “

source: །དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་དེ་ལྟར་ལུས་སྟོང་པ་ནམ་མཁའ་ལྟ་བུ་ལ་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ཡང་མེད་དོ་ཞེས་སོ་སོར་རྟོག་པའི་ཕྱིར་རོ།
en: Because the movement of breath in and out is unfindable”— this is because upon analysis there is no movement of breath in and out because the body is empty like space. “

source: །རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་དཔྱོད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པ་དང་རྣམ་པར་དཔྱོད་པ་གཉིས་ཚིག་མངོན་པར་འདུ་བྱེད་པ་ཡིན་པའི་ཕྱིར་དེ་སྐད་གསུངས་ཏེ་སྔར་རྣམ་པར་བརྟགས་རྣམ་པར་དཔྱད་ནས་ཕྱིས་ཚིག་འབྱིན་ཏོ་ཞེས་འབྱུང་བའི་ཕྱིར་རོ།
en: Because applied and sustained thought is unfindable”— it says this because the two, applied and sustained thought, occasion words, because it is said, “Having applied their mind and thought in a sustained way earlier, later on they deliver a speech.” “

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་ཕུང་པོ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་དེ་དག་གཟུགས་མེད་པས་མིང་གི་ཚོགས་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: Because the feeling, perception, volitional factors, and consciousness aggregates are unfindable.” Because they have no form they are in their nature just a collection of names. “

source: །ཆོས་ཐམས་ཅད་འགྲོ་བ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་འགྲོ་བ་དང་བྲལ་བའི་ཕྱིར་རོ།
en: Because all phenomena do not go away.” Because all phenomena are separated from going. “

source: །ཆོས་ཐམས་ཅད་གཟུང་དུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ལ་ཆོས་རྣམས་ནི་ཆོས་རྣམས་མི་འཛིན་ཏེ། དེ་བས་ན་མི་འཕྲོགས་པའོ།
en: Because all dharmas cannot be seized.” Dharmas do not seize dharmas, so it “is not stolen.” “

source: །ཆོས་ཐམས་ཅད་ཤིན་ཏུ་བྱང་ཞིང་ཟད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་བྱང་བས་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པའི་བདག་ཉིད་ཀྱིས་ཟད་པར་སྣང་བའོ།
en: Because all dharmas have come to an end in extreme purity.” Because all dharmas appear as an extreme purity they do not arise and are not stopped, and hence appear to have come to an end. “

source: །ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་འགག་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་སྟོང་པ་སྟེ་སྐྱེ་བ་ཡང་མེད་འགག་པ་ཡང་མེད་པར་སྣང་བའོ།
en: Because all dharmas do not arise and do not stop.” All dharmas are empty. They appear as not arising and as not stopping. “

source: །འཆི་འཕོ་དང་སྐྱེ་བ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་དེའི་ཚེ་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དག་ཀུན་བརྟགས་པའི་དབང་གིས་སྣང་གི།
en: Because death and rebirth are unfindable.”

source: དོན་དམ་པར་ནི་མ་ཡིན་པར་ཤེས་པའོ།
en: It knows that the time of deaths and rebirths appear based on false imagination, not ultimately. “

source: །ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་འཇིག་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ནི་དེ་བཞིན་ཉིད་དེ། །དེ་ཡང་འགྱུར་བ་མེད་པའི་ཕྱིར་མི་འཇིག་པའོ།
en: Because all dharmas are indestructible in their nature.” It is indestructible because the nature of all dharmas is suchness, so it does not change. “

source: །རྨི་ལམ་མཐོང་བ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་རྨི་ལམ་གྱི་མཐོང་བའི་མིའི་རྨི་ལམ་གྱི་དངོས་པོ་གང་ཡིན་པ་དེ་མི་དམིགས་ཤིང་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དངོས་པོ་མེད་པར་གནས་པའོ།
en: Because a dream that has been seen cannot be apprehended.” Just as that thing existent in a dream which has been seen in a dream cannot be apprehended and does not exist, so too all phenomena are there as nonexistent things. “

source: །འདི་ནི་རྣམ་པར་བྱང་བ་མ་མཆིས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This is a perfection without purification… because the presence of defilement cannot be apprehended.”

source: ཀུན་ནས་ཉོན་མོངས་པ་ཡོད་པར་མི་དམིགས་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཡོད་ན་ནི་རྣམ་པར་བྱང་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་ན་འདི་ལྟར་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་ཡོངས་སུ་དག་པ་སྟེ། དེ་བས་ན་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་མེད། རྣམ་པར་བྱང་བ་ཡང་མེད་དོ།
en: There can be purification if there is defilement, but all phenomena are pure in their nature so there is no defilement and there is no purification either. “

source: །འདི་ནི་གནས་མ་མཆིས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This is a perfection that does not stand… because all phenomena cannot be apprehended.”

source: ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་གང་གི་ཕྱིར་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་དེའི་ཕྱིར་གང་ན་ཡང་གནས་པར་མི་དམིགས་པའོ།
en: Because all phenomena cannot be apprehended they therefore are not apprehended as standing anywhere. “

source: །ཆོས་ཐམས་ཅད་མ་ནོར་བ་དེ་བཞིན་ཉིད་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ནི་མ་ནོར་བ་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དེ་མ་ནོར་བའི་ངོ་བོ་ཉིད་མངོན་སུམ་དུ་བྱེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཞི་བའོ་ཞེས་ཤེས་རབ་ཉེ་བར་གནས་སོ།
en: Because it is a full awakening to all dharmas as unmistaken suchness.” All phenomena are the intrinsic nature of unmistaken suchness, which is to say, they make manifest that unmistaken intrinsic nature so they make available the wisdom that knows “all phenomena are calm.” “

source: །འདོད་ཆགས་ཀྱི་མཚན་མ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆགས་པར་བྱ་བའི་དངོས་པོའི་མཚན་མ་མེད་པའོ།
en: Because the causal sign of greed cannot be apprehended.” There is no causal sign that is a basis to become attached to. “

source: །ཞེ་སྡང་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཞེ་སྡང་གི་རྒྱུར་གྱུར་པའི་མཚན་མ་མེད་པའོ།
en: Because hate is not real.” Because the causal sign that serves as a cause of hate does not exist. “

source: །འདི་ནི་ཚད་མ་མཆིས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This perfection of wisdom is a perfection that is not a means of measurement… because all phenomena do not fully arise.”

source: ཆོས་ཐམས་ཅད་ཀུན་ནས་ལྡང་བ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ལ་ཆོས་ཐམས་ཅད་ནི་ཚད་མའི་དབང་གིས་ཀུན་ནས་བསླང་བ་ཡིན་ན་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚད་ཀུན་དུ་འབྱུང་བའི་གཞི་མི་མཐོང་སྟེ་དེ་བས་ན་ཚད་མེད་པའོ།
en: It might be supposed that all phenomena are caused to fully arise on account of a means of measurement. But this perfection of wisdom does not see the emergence of a basis for the measurement of any phenomenon, therefore it is “not a means of measurement.” “

source: །ཆོས་ཐམས་ཅད་འདྲེས་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་དབེན་པའི་ཕྱིར་རོ།
en: Because all phenomena are distinct.” Because all dharmas are isolated. “

source: །ཆོས་ཐམས་ཅད་ཚད་མ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་གཞལ་བྱ་ཡོད་ན་ཚད་མ་ཡང་ཡོད་ན་གཞལ་བྱ་ཡང་ཡོད་པར་འགྱུར་ན་འདི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་ཚད་མ་མི་དམིགས་ཤིང་མེད་པས་དེ་བས་ན་གཞལ་བྱ་མེད་དོ།
en: Because the measure of all phenomena cannot be apprehended.” There might be a means of measurement were there something to be measured. But because a means of measurement of all phenomena, were there to be something measured, cannot be apprehended and does not exist, therefore something to be measured does not exist either. “

source: །ཆོས་ཐམས་ཅད་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་འདྲ་བར་ཆགས་པ་མེད་པའོ།
en: Because all phenomena are without attachment like space.” All phenomena, similar to space, are without attachment. “

source: །འདི་ནི་མི་རྟག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། ཆོས་ཐམས་ཅད་འཇིག་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རི་བོང་གི་རྭ་ལ་སོགས་པ་བཞིན་དུ་མ་སྐྱེས་པའི་ཕྱིར་མི་འཇིག་པ་སྟེ་དེ་བས་ན་མེད་དོ།
en: This… is an impermanent perfection Because all dharmas are unproduced, like horns on a rabbit and so on, they are not destroyed.

source: །ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་མི་རྟག་པ་སྟེ་མེད་པའི་དོན་ནི་མི་རྟག་པའི་དོན་ཏོ་ཞེས་འབྱུང་བའི་ཕྱིར་རོ།
en: Therefore, they do not exist. They are impermanent because they are not existent things, because scripture says that “the meaning of a nonexistent thing is the meaning of impermanence.” “

source: །ཆོས་ཐམས་ཅད་ལྷག་པར་ཞེན་པར་བྱ་བའི་འོས་མ་ཡིན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ལྷག་པར་ཞེན་པར་བྱ་བའམ།
en: Because all phenomena are not suitable to be clung to.”

source: གནས་པར་བྱ་བའམ། ཉེ་བར་སྤྱད་པར་བྱ་བའི་འོས་མ་ཡིན་ཏེ་དེ་བས་ན་སྡུག་བསྔལ་བའོ།
en: All phenomena are not suitable to be clung to, or to be stayed with, or to be made use of, so it is suffering. “

source: །འདི་ནི་སྟོང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་གཟུགས་སུ་རུང་བ་དང་།
en: This… is a perfection of the empty… because an intrinsic nature of all phenomena cannot be apprehended.”

source: མྱོང་བ་ལ་སོགས་པའི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་དོན་དམ་པར་ཡོད་པ་མ་ཡིན་ཏེ།
en: Those intrinsic natures—easily breakable, experience, and so on—do not ultimately exist.

source: དེ་བས་ན་ཆོས་དེ་དག་ངོ་བོ་ཉིད་དེས་སྟོང་ངོ་།
en: Therefore, those phenomena are empty of those intrinsic natures. “

source: །འདི་ནི་བདག་མ་མཆིས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། ཆོས་ཐམས་ཅད་མངོན་པར་ཞེན་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མེད་དོ།
en: This… is a selfless perfection… because all phenomena are not settled down on.” The “phenomena,” form and so on, do not exist.

source: །དེའི་ཕྱིར་དེ་དག་མངོན་པར་ཞེན་པར་བྱ་བའི་འོས་མ་ཡིན་ཏེ།
en: They are therefore not suitable to be “settled down on.”

source: དེ་ལྟར་ན་ཆོས་ཐམས་ཅད་མེད་པ་ནི་བདག་མེད་པའོ།
en: Since that is the case, the nonexistence of all the phenomena is selflessness.

source: །སྟོང་པ་ཉིད་དང་བདག་མེད་པ་གཉིས་ལ་དོན་ཐ་དད་པ་མེད་དུ་ཟིན་ཀྱང་བརྟགས་པའི་དབང་གིས་ཐ་དད་པ་ཡོད་དོ།
en: Even though there is no difference in the meaning of emptiness and selflessness, based on being designated they are differentiated. “

source: །སྟོང་པ་ནི་གཞན་བྲལ་བ་སྟེ།
en: The empty” is being without something else.

source: དཔེར་ན་ཆུ་དང་བྲལ་བའི་ཕྱིར་བུམ་པ་སྟོང་པ་ཞེས་བྱ་བ་ལྟ་བུའོ།
en: To illustrate, you say “an empty pot” when it has no water.

source: །དེ་བཞིན་དུ་རང་གི་མཚན་ཉིད་ལ་སོགས་པའི་ངོ་བོ་ཉིད་དང་བྲལ་བའི་ཕྱིར་ཆོས་དེ་དག་ཉིད་ལ་སྟོང་པ་ཞེས་ཀུན་ཏུ་རྟོག་གོ།
en: Similarly, because they are without an intrinsic nature, their “defining mark” and so on, those phenomena are thought of as “empty.”

source: །བདག་མེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་རྣམས་མེད་པ་ཉིད་དེ། དཔེར་ན་སྒྱུ་མའི་གླང་པོ་ཆེ་ལ་སོགས་པ་ལྟ་བུའོ། །ཆོས་དེ་དག་ཉིད།
en: As for “selfless,” it is the nonexistence of the phenomena, like, to illustrate, the magically produced illusion of elephants and so on.

source: རང་གི་མཚན་ཉིད་ལ་སོགས་པ་དང་བྲལ་བར་བརྗོད་པར་འདོད་པ་ལ་སྟོང་པ་ཞེས་བྱའོ།
en: You say “empty” when you want to say those phenomena are separated from their defining marks and so on.

source: །ཡོད་པ་མ་ཡིན་ནོ་ཞེས་དངོས་པོ་མེད་པར་བརྗོད་པར་འདོད་པ་ལ་ནི་བདག་མེད་པ་ཞེས་བྱའོ།
en: You say “selfless” when you want to say that “they are not existent”—they are not existent things. “

source: །ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ལ་མཚན་མ་ནི་མཚན་ཉིད་ཡིན་ན་འདི་ལྟར་མཚན་མ་མེད་པས་དེའི་ཕྱིར་མཚན་ཉིད་མེད་པའོ།
en: Because all phenomena have no causal sign.” Given that a causal sign is a defining mark and there is no such defining mark they are “without a defining mark.” “

source: །སྟོང་པ་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་གཉིས་པ་མེད་པ་ཙམ་ལ།
en: Because the emptiness of emptiness cannot be apprehended.” This means there is just no second emptiness in emptiness.

source: སྟོང་པ་སྟོང་པ་ཉིད་ཅེས་བྱའི།
en: The empty is said to be “emptiness.”

source: སྟོང་པ་སྟོང་པ་ཉིད་ཅེས་བྱ་བའི་ཆོས་གཞན་ནི་གང་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: An “empty” that is a different attribute called “emptiness” does not exist at all. “

source: །ཆེན་པོ་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཕྱོགས་ཐམས་ཅད་ན་ཡང་གཟུགས་རྣམས་མེད་པ་ཙམ་གྱི་ཆེ་བ་ལ་ཆེན་པོ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: The great emptiness cannot be apprehended.” “Great emptiness” is said of the immensity of just the nonexistence of forms for all the directions.

source: །ཆེན་པོ་སྟོང་པ་ཉིད་ཅེས་བྱ་བའི་ཆོས་གཞན་ནི་གང་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: A different attribute called “the great emptiness” does not exist at all.

source: །འདི་ནི་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This… is a perfection that is the emptiness of a basic nature… because compounded and uncompounded dharmas cannot be apprehended.”

source: འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་འདུས་བྱས་དང་འདུས་མ་བྱས་པའི་ཆོས་རྣམས་དམིགས་སུ་ཡོད་ན་ནི་དེ་དག་གི་རང་བཞིན་སྟོང་པ་མ་ཡིན་པར་འགྱུར་བ་ཞིག་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་པ་སྟེ། དེ་བས་ན་དེ་དག་གི་རང་བཞིན་སྟོང་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means if compounded and uncompounded dharmas were findable, their basic nature would be not empty, but all dharmas are empty, hence their “emptiness of a basic nature.” “

source: །འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This… is a perfection that is giving… because miserliness cannot be apprehended.”

source: སེར་སྣ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེར་སྣ་དམིགས་སུ་མེད་པ་གང་ཡིན་པ་དེ་ཡང་སྦྱིན་པའི་མཚན་ཉིད་དོ།
en: The miserliness that cannot be apprehended in the perfection of wisdom is the mark of giving.

source: །འདི་ནི་སྟོབས་བཅུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This… is a perfection that is the ten powers… because all the aspects of all dharmas cannot be apprehended.”

source: ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ནི་གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པའི་སྟོབས་ལ་སོགས་པ་ཡེ་ཤེས་བཅུའི་སྤྱོད་ཡུལ་ཡིན་ན་དེ་དག་གི་སྤྱོད་ཡུལ་དུ་མ་གྱུར་པ་ནི་རྣམ་པ་ཡོད་པ་མ་ཡིན་ཏེ།
en: All the aspects of all dharmas would fall within the range of the ten knowledges—the power that is knowledge of the possible and impossible and so on. But they are not within their range, they are unreal aspects.

source: འདི་ལྟར་རྣམ་པ་དེ་དག་དོན་དམ་པར་མེད་པས་དེའི་ཕྱིར་སྟོབས་བཅུའི་ཡུལ་དུ་གྱུར་པ་རྣམ་པ་རྣམས་མེད་པར་མཐོང་བའི་ཕྱིར་སྟོབས་བཅུའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: So, because those aspects do not ultimately exist, therefore the aspects that serve as the objects of the ten powers are seen not to exist, hence it is “a perfection that is the ten powers.” “

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཞུམ་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་ཆོས་གང་ཡང་ཞུམ་པ་མེད་དེ་དེ་བས་ན་ཐམས་ཅད་དུ་ཞུམ་པ་མེད་པའི་རང་བཞིན་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་མི་འཇིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Because the knowledge of path aspects is not cowed.” The knowledge of path aspects of bodhisattvas is not cowed by any phenomenon. Therefore, the knowledge of path aspects, which in its nature is uncowed by anything, is “a perfection that is fearlessness.” “Because knowledge is totally unattached and unimpeded.”

source: །ཐམས་ཅད་དུ་ཡེ་ཤེས་ཆགས་པ་མེད་ཅིང་ཐོགས་པ་མེད་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ནི་ཐམས་ཅད་དུ་ཆགས་པ་མེད་པ་དང་། ཐོགས་པ་མེད་པ་སྟེ། དེ་བས་ན་དེ་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: Because the knowledge of bodhisattvas is totally unattached and unimpeded, therefore it is “a perfection that is detailed and thorough knowledge.” “

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཉན་ཐོས་ལ་སོགས་པ་ལ་མེད་པས་དེའི་ཕྱིར་དེ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཞེས་བྱ་བར་བགྲང་ངོ་། །འདི་ནི་དེ་བཞིན་གཤེགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Because it has gone beyond all śrāvaka and pratyekabuddha attributes.” Because śrāvakas and so on do not have this perfection of wisdom it is therefore counted as “a perfection that is the… attributes of a buddha.” “

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་དེ་བཞིན་གཤེགས་པ་ཉིད་ཡིན་པའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ངེས་པའི་ཚིག་གིས་ནི་དེ་བཞིན་དུ་གསུང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་སྟེ།
en: This… is a perfection that is the realized one… because what has been spoken by all the buddhas is reality.”

source: སངས་རྒྱས་ཀྱིས་གསུངས་པ་ཐམས་ཅད་ལ་དེ་བཞིན་དུ་དམིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་བཞིན་གཤེགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: By a creative explanation, the realized one is so called because of having spoken thus, which is to say, the perfection of wisdom that observes thus—what has been spoken by all the buddhas—is called the “perfection that is the realized one.” “

source: །འདི་ནི་རང་བྱུང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: This… is a perfection that is self-originated… because it is in control of all dharmas.”

source: ཆོས་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བའི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་དེའི་དབང་དུ་འགྱུར་ཏེ། དེའི་ཕྱིར་རང་གིས་ཆོས་ཐམས་ཅད་ཟིལ་གྱི་གནོན་པས་རང་བྱུང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །བརྒྱ་བྱིན་གྱིས་བསྔགས་པའི་ཚིག་དང་། གནས་བརྟན་ཤཱ་རིའི་བུའི་ཚིག་དང་།
en: Because all dharmas are under its control, therefore it predominates among all dharmas so it is a “self-originated perfection.”

source: བཅོམ་ལྡན་འདས་རྗེས་སུ་ཡི་རང་བའི་ཚིག་རྣམས་ནི་བརྡ་ཕྲད་པར་སླ་བས་མདོ་ལས་ཇི་སྐད་འབྱུང་བ་བཞིན་ནོ།
en: Explanation of Chapters 39 to 42 Absence of a practice and signs of completion It is easy to explain Śatakratu’s praise passage, the elder Śāriputra passage, and the Lord’s rejoicing passage so they are just as they are in the Sūtra. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་གཟུགས་ལ་མི་གནས་པ་དེའི་ཚེ་གཟུགས་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ནི་ཆོས་གང་ལ་ཡང་མི་གནས་ཏེ། དེ་བས་ན་མི་གནས་པ་ཉིད་དེའི་བརྩོན་པར་བྱེད་པ་ཞེས་བྱའོ།
en: When practicing the perfection of wisdom [they] do not stand in form, and when they do not stand in form they practice the yoga of form.” The bodhisattvas’ transcendental knowledge of a knower of path aspects does not stand in any phenomenon, therefore just that not standing is their “practice of the yoga.” “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་ལ་བརྩོན་པར་མི་བྱེད་དེ་འདི་ལྟར་གཟུགས་ལ་བརྩོན་པར་མི་བྱེད་པ་འདི་ལྟ་བུ་ནི་གཟུགས་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་འགྲེས་སྔ་མར་ནི་གནས་པ་བཀག་གོ།
en: Furthermore, Kauśika, they do not practice the yoga of a bodhisattva’s form, and thus not practicing the yoga of form like that, they practice the yoga of form.” The earlier subsection of the passage refutes standing; here it refutes what is established by not standing. “

source: །འདིར་ནི་བསྒྲུབ་པ་བཀག་གོ། །གཟུགས་སྔོན་གྱི་མཐར་མི་དམིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པས་དུས་གསུམ་ཆར་དུ་ཡང་མི་དམིགས་པར་སྟོན་ཏོ།
en: Do not apprehend form as past,” and so on, teaches that they do not apprehend it in any of the three time periods. “

source: །ཤཱ་རིའི་བུ་འདི་ལྟར་གཟུགས་ཀྱི་ཟབ་པ་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཟབ་པ་ཞེས་བྱ་བ་ཀུན་བརྟགས་པ་ཡིན་པའི་ཕྱིར་དོན་དམ་པར་གཟུགས་ཉིད་མེད་པས་དེ་སྐད་ཅེས་བྱའོ། །ཟབ་པའི་འགྲེས་དང་། གཏིང་དཔག་དཀའ་བའི་འགྲེས་དང་། ཚད་མེད་པའི་འགྲེས་དང་། བརྒྱ་བྱིན་གྱི་ཚིག་དང་།
en: Śāriputra, it is because the depth of form is not form.”

source: ལུང་བསྟན་པ་ཐོབ་པ་དང་།
en: It says this because “the depth” is falsely imagined, so form itself ultimately does not exist.

source: འབྲོག་དགོན་པའི་དཔེ་དང་། རྒྱ་མཚོ་ཆེན་པོའི་དཔེ་དང་། དཔྱིད་ཀྱི་དཔེ་དང་། སྦྲུམ་མའི་དཔེ་དང་། རྗེས་སུ་བཟུང་ཞིང་ཡོངས་སུ་བསྟན་པའི་ཚིག་འདི་རྣམས་ནི་བརྡ་ཕྲད་པར་སླའོ།
en: The interpretation of the depth subsection, hard to fathom subsection, and immeasurable subsection; the Śatakratu passage and obtaining a prediction; the wilderness analogy, the spring analogy, and the pregnant woman analogy; and the passage on taking care of and teaching others is easy.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པའི་རྟགས་རྣམ་པ་གཉིས་ཏེ། ཆོས་ཐམས་ཅད་འཕེལ་བ་དང་། འགྲིབ་པར་མི་མཐོང་བ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་མཐོང་བའོ།
en: There are two signs that “the meditation on the perfection of wisdom… is completed”— when they “do not see… an increase… or a decline in” all dharmas, and when they see the marks of dharmas.
